cleanup and fix links in existing docu
