--- a/docs/tutorial/soh/steering.md
+++ b/docs/tutorial/soh/steering.md
@@ -12,39 +16,44 @@ Adding new transportation modalities is supported by the ``MultimodalAgent`` if 
 
 ![uml_multimodal_agent](uml_multimodal_agent.png)
 
-```plantUml
 
-interface IPassengerCapable {
-    Notify(passengerMessage:PassengerMessage) : void
-}
-IPositionable <|-- IPassengerCapable
+```mermaid
+classDiagram
 
-enum PassengerMessage {
-    GoalReached,
-    NoDriver,
-    TerminalStation,
-}
+    class IPassengerCapable {
+        <<Interface>>
+        Notify(passengerMessage:PassengerMessage) void
+    }
 
-interface ISteeringCapable {
-}
-IPassengerCapable <|-- ISteeringCapable
+    class IWalkingCapable {
+        <<Interface>>
+        PreferredSpeed double
+    }
 
+    class ISteeringCapable {
+        <<Interface>>
+    }
 
-interface IWalkingCapable {
-    PreferredSpeed : double <<get>>
-}
-ISteeringCapable <|-- IWalkingCapable
+    IPositionable <|-- IPassengerCapable
+    IPassengerCapable <|-- ISteeringCapable
+    ISteeringCapable <|-- IWalkingCapable
 
-class WalkingSteeringHandle {
-    + WalkingSteeringHandle(multimodalAgent:MultimodalAgent, accelerator:WalkingAccelerator, environment:ISpatialGraphEnvironment, position:Position)
-    + Environment : ISpatialGraphEnvironment <<get>>
-    + Route : Route <<get>> <<set>>
-    + GoalReached : bool <<get>>
-    + Velocity : double <<get>>
-    + <<virtual>> Move() : void
-    + Position : Position <<get>> <<set>>
-    + LeaveVehicle(passengerCapable:IPassengerCapable) : bool
-}
-ISteeringHandle <|-- WalkingSteeringHandle
+    class WalkingSteeringHandle {
+        + WalkingSteeringHandle(multimodalAgent:MultimodalAgent, accelerator:WalkingAccelerator, environment:ISpatialGraphEnvironment, position:Position)
+        + Environment : ISpatialGraphEnvironment
+        + Route : Route
+        + GoalReached : bool
+        + Velocity : double
+        + <<virtual>> Move() void
+        + Position : Position
+        + LeaveVehicle(passengerCapable:IPassengerCapable) bool
+    }
+    ISteeringHandle <|-- WalkingSteeringHandle
 
+    class PassengerMessage {
+        <<Enumeration>>
+        GoalReached
+        NoDriver
+        TerminalStation
+    }
 ```
