--- a/docs/tutorial/soh/agents/multi_capable_agent.md
+++ b/docs/tutorial/soh/agents/multi_capable_agent.md
@@ -1,45 +1,62 @@
-Moreover it allows to use the [``ferry``](../entities/ferry.md) and walking (``Pedestrian``). 
+Moreover, it allows to use the [``ferry``](../entities.md#ferry) and walking (``Pedestrian``). 
 
-```plantUml
-abstract class MultiCapableAgent {
-    + MultiCapableAgent(multimodalLayer:IMultimodalLayer, position:Position)
-    + Capabilities : IEnumerable<ModalType> <<get>>
-    + AgentCapabilities : string <<get>>
-    + CapabilityDriving : bool <<get>> <<set>>
-    + CapabilityCycling : bool <<get>> <<set>>
-    + ExpectedTravelTime : int <<get>> <<protected set>>
-    + StoreTickResult : bool <<get>> <<set>>
-    + ActualTravelTime : int <<get>>
-    + RouteMainModalActualTravelTime : int <<get>> <<protected set>>
-    + RouteMainModality : string <<get>>
-    + RouteModalities : string <<get>>
-    + RouteModalityCount : int <<get>>
-    + RouteMainModalRouteLength : int <<get>>
-    + <<override>> Move() : void
-    + <<override>> Notify(passengerMessage:PassengerMessage) : void
-    + ActiveCapability : ModalType <<get>>
-    + OvertakingActivated : bool <<get>>
-    + CurrentlyCarDriving : bool <<get>>
-    + DriverRandom : double <<get>>
-    + DriverType : DriverType <<get>>
-    + CyclingPower : double <<get>>
-    + Gradient : double <<get>> = 0
-}
-Pedestrian <|-- MultiCapableAgent
-ICarSteeringCapable <|-- MultiCapableAgent
-IBicycleSteeringAndRentalCapable <|-- MultiCapableAgent
+```mermaid
+classDiagram
+
+   Pedestrian <|-- MultiCapableAgent
+   ICarSteeringCapable <|-- MultiCapableAgent
+   IBicycleSteeringAndRentalCapable <|-- MultiCapableAgent
+
+   class MultiCapableAgent {
+      <<Abstract>>
+      + MultiCapableAgent(multimodalLayer:IMultimodalLayer, position:Position)
+      + Capabilities IEnumerable~ModalType~
+      + AgentCapabilities string 
+      + CapabilityDriving bool  
+      + CapabilityCycling bool  
+      + ExpectedTravelTime int  protected set
+      + StoreTickResult bool  
+      + ActualTravelTime int 
+      + RouteMainModalActualTravelTime int  <<protected set>>
+      + RouteMainModality string 
+      + RouteModalities string 
+      + RouteModalityCount int 
+      + RouteMainModalRouteLength int 
+      + ^Move() void
+      + ^Notify(passengerMessage:PassengerMessage) void
+      + ActiveCapability ModalType 
+      + OvertakingActivated bool 
+      + CurrentlyCarDriving bool 
+      + DriverRandom double 
+      + DriverType DriverType 
+      + CyclingPower double 
+      + Gradient double = 0.0
+   }
+
+   class ICarSteeringCapable {
+      <<Interface>>
+   }
+
+   class IBicycleSteeringAndRentalCapable {
+      <<Interface>>
+   }
+
 ```
 
-### Dynamic capabilities
+## Dynamic capabilities
