--- a/docs/tutorial/soh/layers/scheduling_layer.md
+++ b/docs/tutorial/soh/layers/scheduling_layer.md
@@ -1,35 +1,34 @@
 
 The model for the `SchedulerLayer` looks like this:
 
-```plantUml
-abstract class SchedulerLayer {
- # SchedulerLayer()
- # SchedulerLayer(table:DataTable)
- + <<override>> InitLayer(layerInitData:TInitData, register:RegisterAgent, unregistere:UnregisterAgent) : bool
- + <<override>> PreTick() : void
- # <<virtual>> CanSchedule(entry:SchedulerEntry, lasted:TimeSpan, intervalStart:DateTime) : bool
- # {abstract} Schedule(dataRow:SchedulerEntry) : void
- # <<virtual>> RandomPositionFromGeometry(geometry:IGeometry) : Position
- # <<virtual>> RandomPositionFromPolygon(geometry:IGeometry) : Position
- # <<virtual>> RandomPositionFromLineString(lineString:IGeometry) : Position
-}
-class "IntervalTree`2"<T1,T2> {
-}
-AbstractActiveLayer <|-- SchedulerLayer
-SchedulerLayer --> "TimeSeries<DateTime,SchedulerEntry>" "IntervalTree`2"
-SchedulerLayer --> "SchedulingTable" DataTable
 
+```mermaid
+classDiagram
+
+    class SchedulerLayer {
+        <<abstract>>
+        # SchedulerLayer()
+        # SchedulerLayer(table:DataTable)
+        + ^InitLayer(layerInitData:TInitData, register:RegisterAgent, unregistere:UnregisterAgent) bool
+        + ^PreTick() void
+        # Schedule(dataRow:SchedulerEntry)* void
+    }
+
+    AbstractActiveLayer <|-- SchedulerLayer
+    SchedulerLayer --> IntervalTree2 : TimeSeries~DateTime,SchedulerEntry~
+    SchedulerLayer --> DataTable : SchedulingTable
 ```
-The ``SchedulerLayer`` is an **active** layer (more about active layers can be found [here](../../core/basic-concepts/layers.md)) and queries the ``TimeSeries`` depending on the current simulation time.
+
+The `SchedulerLayer` is an **active** layer (more about active layers can be found [here](../../development/layers.md)) and queries the `TimeSeries` depending on the current simulation time.
@@ -57,21 +56,24 @@ The `Schedule` method is called exactly when there is an entry with a valid peri
 
 The model for the `SchedulerEntry` looks like this:
 
-```plantUml
-class SchedulerEntry {
- + SpawningIntervalInMinutes : int <<get>> <<set>>
- + SpawningAmount : int <<get>> <<set>>
-}
-class "IDictionary`2"<T1,T2> {
-}
-SchedulerEntry --> "Data<string,object>" "IDictionary`2"
-SchedulerEntry --> "StartValidTime" DateTime
-SchedulerEntry --> "EndValidTime" DateTime
-SchedulerEntry --> "SourceGeometry" IGeometry
-SchedulerEntry --> "TargetGeometry" IGeometry
+```mermaid
+classDiagram
+    class SchedulerEntry {
+        + SpawningIntervalInMinutes : int
+        + SpawningAmount int
+    }
+    
+    class IDictionary~T1,T2~ {
+    }
+
+    SchedulerEntry --> IDictionary : Data~string,object~
+    SchedulerEntry --> DateTime : StartValidTime
+    SchedulerEntry --> DateTime : EndValidTime
+    SchedulerEntry --> IGeometry : SourceGeometry 
+    SchedulerEntry --> IGeometry : TargetGeometry 
 ```
 
-## Scheduleing Layer Parametrisierung
+## Scheduling Layer parameters
